import streamlit as st

st.title("planet info")

st.write("The Sun(太陽):\n\n",

        "◇太陽は英雄になるための力を授けてくれる\n\n",

        "「あなた何座?」と聞かれて即座に答えられる星座、それが誕生日から導きだす「太陽の星座」です。\n\n",
        "よく雑誌の後ろのページに載っている星占いの星座が、それですね。これは、あなたが生まれた時に太陽が入っていた星座を表し、今では最もポピュラーな星座として、広く人々に知れ渡っています。\n\n",
        "この太陽の星座、厳密に言うと、実は「生まれ持った性格」を表しているのではありません。雑誌などで「牡羊座の性格」などと書かれたりしているので誤解されている人も多いでしょう。\n\n",
        "それは、複雑な西洋占星術をよりわかりやすく示すために、誕生日から簡単に知ることができる太陽の星座を代表格に据えて書かれたに過ぎないのです。では、「太陽の星座」とは、一体何を表すのでしょうか。\n\n",
        "それは、その人が自分らしく人生を切り開いていくための力を表します。言い方を変えるとしたら、自分が目指そうとしている生き方や人生の目標、それを達成するための方法を示しているのです。\n\n",
        "太陽は、世界中のあらゆる神話の中でも重要な位置を占めています。中でもよく知られているのは、ギリシア神話の太陽神アポロン。アポロンは太陽、精神、音楽、そして予言の神と言われ、健全な肉体と精神を持った青年の神として言い伝えられています。\n\n",
        "その姿は、まさに英雄の如し。占星術が示す太陽も、自分の中の英雄的な面を表しています。英雄というのは、困難なことを成し遂げて初めて、英雄と呼ばれるわけです。つまり英雄になるために必要なこと、例えば障害を乗り越えて未来へと突き進むエネルギーや、理想を追求し、妥協せずに自分を鍛え上げてゆく力といったものは、すべてこの太陽が授けてくれるものなのです。\n\n",
        "太陽が牡羊座の場合を、例にとって説明してみましょう。牡羊座に太陽がある人は、よく目にする性格分析では、負けず嫌いで挑戦的と解釈されます。でも、それは表面的な解釈に過ぎません。\n\n",
        "太陽の意味合いをより深く理解するなら、何かに挑戦し、戦うことによって人生を切り開いてゆき、自分の生きる道を作り上げて行こうとする、それが、牡羊座の太陽の特徴なのです。\n\n",
        "そうすることで、自分を表現し、自分らしく生きることができるわけです。そういう観点から太陽の星座を解釈していくと、おそらくこれまでよく目にしてきた性格的な特徴とは異なる部分が見えてくると思います。\n\n",
        "もし、太陽の力が充分発揮されていなければ、あなたは自分の進むべき道を見出せず、モラトリアムな心理状態に陥ってしまうでしょう。自分が自分らしく生きるために太陽が与えてくれているものは何なのか、是非それを発見してください。\n\n")

st.write("Moon(月)\n\n",

        "◇月は「内なる子供」のすみか\n\n",

        "西洋占星術の中で太陽と双璧を成して重要なのが「月」。太陽が自分の意思や、「こうなりたい」という意識的な目標を示すのに対して、月は本能的な欲求や感情などを司っています。\n\n",
        "まるで刻々と変化する月のように、移ろいゆく心の奥底を表しているのが「月」の役割なのです。\n\n",
        "少し専門的な話になってしまいますが、月の星座を解釈する上で、そのイメージを膨らませてもらうためにも記しておきたいことがあります。占星術では、太陽は意識的な世界を象徴し、月は無意識的な世界を象徴するとしています。\n\n",
        "この無意識的な世界は、心理学で言う「インナーチャイルド(内なる子供)と言われる概念と関係しているのです。これは幾つになっても心の中に住んでいる、本能的な子供の自分を表します。\n\n",
        "社会的な「大人の自分」の内側に隠されている、欲求や感情に正直な「子供の自分」。それを表すのが、占星術では「月」と言うわけです。\n\n",
        "月は動きが速く、2日~3日で星座を移動します。そのため、4月1日生まれと4月4日生まれとでは、月の入っている星座がもう違ってきてしまいます。雑誌の後ろによくある星占いのページだと、4月1日生まれも4月4日生まれも同じ牡羊座ですが、これは太陽が入っている「太陽星座」。\n\n",
        "太陽星座が同じ牡羊座同士でも、性格や個性がどうも違うと言うのは、この月の星座が異なっているからでもあるのです。\n\n",
        "こうした月が表す内なる子供の部分は、本能がむき出しであるが故に、ある意味とってもわがままですし、非合理的でもあるし、甘ったれで無茶な要求を突きつけてくることもあります。そうした心の奥に潜む子供の本能的な欲求を、大人の自分が理性で押さえつけようとするわけです。\n\n",
        "でも、あまり強く抑えつけてしまうと、心が不安定になってきます。息が詰まってしまい、その結果、ストレスを抱えたり、欲求不満に陥ったりすることもあるでしょう。そうならないためにも、月の入っている星座を知って、自分の心の安定がどうしたら保たれるのかをわかっておくのは、とても意味があることなのです。\n\n",
        "言い換えると、月は、自分が自分らしく、のびのびと楽でいられる状態を表しているともいえるでしょう。そうした自分の中の月のパワーを上手に解放してあげることができれば、あなたの心理面は安定し、ポジティブになれるのです。\n\n",
        "けれども、解放できずに燻ってしまうと、マイナスの感情が湧いてきたりして、心がささくれてしまいます。\n\n",
        "さて、あなたの月は何座に入っているでしょうか。自分のホロスコープで月の星座を見て、「内なる子供」の自分探しをしてみてください。きっと太陽星座では得られなかった、あなたの心の奥深くに潜んでいる本性がじんわりと浮かび上がってくることでしょう。\n\n")

st.write("Mercury(水星)\n\n",

        "◇知性とコミュニケーションを司る水星\n\n",

        "私たち人間には優れた知的能力が備わっています。未知のことを知りたいと言う欲求や向学心、他の人に考えや感情を伝える言語力と文章力、周囲の人々とうまく付き合っていくコミュニケーション能力、言い出た才能や技術。こうしたことはすべて人間の知性がなせる業といえるでしょう。占星術において、この知的能力を司っているのが水星なのです。水星は、ギリシア神話ではヘルメースという神にあたります。ヘルメースは才気煥発で好奇心旺盛、純粋な面を持ちながらも、ずる賢く、いたずら好きなところもあり、実に変幻自在な神でした。この水星の神ヘルメースは、何と生まれてすぐに盗みを働くのです。揺籠から抜け出したヘルメースは、太陽神アポロンの飼っている雌牛をごっそり盗み出します。それを他の神々に生贄として差し出しました。こんな大それたことをしでかしておきながら、その後またゆりかごに戻り、すやすやと眠りについたというのですから、なかなかの肝の据わった神様です。\n\n",
        "もちろん、アポロンは怒り狂いました。でも、ゼウスの仲裁のもと、ヘルメースはアポロンに竪琴を贈って謝ります。許したアポロンはヘルメースに魔法の杖を与え、そのおかげでヘルメースは、天界、地上、冥界の3つの世界を自由自在位に往来し、神々のメッセージを伝えて回ったのでした。\n\n",
        "水星は、その人がどのような知性や才能を持っているのか、どんなふうに他人とコミュニケーションをとり、どういう人間関係を築くのかを示してくれます。能力主義が声高に叫ばれ、ますます対人ストレスが強まる現代では、水星が与えてくれるパワーを使いこなせるかどうかに、社会の荒波を乗り越えてゆくための鍵があるといってもいいでしょう。\n\n",
        "この水星が授けてくれた知的能力をうまく活用できれば、あなたは他人とうまくコミュニケーションをとることができ、多くの友人や支援者を得ることもできるはずです。仕事でも自分の能力をいかんなく発揮でき、着実に実力を伸ばして社会貢献ができるでしょう。\n\n",
        "けれど、もし水星の力がうまく活かされないと、持てる才能を思うように発揮できず、宝の持ち腐れになってしまうかもしれません。対人トラブルやストレスもあなたを苦しめることになり、社会の中で孤立する恐れも出てくるでしょう。\n\n",
        "社会問題になっているニートにしても、水星の授けたパワーをうまく活用できていないために引き起こされる現象のように思えてなりません。そんなふうに、水星が授けている知的能力を眠らせてしまわないためにも、自分の能力やコミュニケーション力をあらためてここで確認しておきましょう。もしかしたら自分で気づかない意外な才能が、まだまだあなたの中に潜んでいるかもしれません。\n\n")

st.write("Venus(金星)\n\n",

        "◇金星は「愛と美」を司るミューズの象徴\n\n",

        "夕暮れ時にいち早く西の空に姿を現す「宵の明星」、そして明け方、東の空に残る「明けの明星」、それが金星です。この一際明るく輝く金星は、ギリシア神話ではアフロディーテ、ローマ神話ではヴィーナスと呼ばれる女神を表し、どちらも「愛と美の女神」として崇め奉られています。\n\n",
        "この女神の誕生は、とてもドラマティックでショッキング。ヘシオドスの「神統記」では、次のように書かれています。\n\n",
        "時の神クロノスが、その父親であるウラノスに襲い掛かり、その生殖器を切り落とした時、ウラノスの精液で海が泡立ちました。その波の間から誕生したのがアフロディーテ。この女神は大きな貝に乗って陸に上がってきたと記されています。ここで画家、ボッティチェリが描いた「ヴィーナスの誕生」という名画を思い出された人もいるでしょう。\n\n",
        "まさにあの絵のように、愛と美の女神はその美しい姿を海中から現したのです。こうした神話を通して、占星術では金星を「愛と美を司る惑星」として位置付けました。人を愛する気持ち、誰かから愛されたいと望む欲求、そして愛する人とひとつになる官能的な喜びも、すべてこの金星が授けてくれているものなのです。\n\n",
        "同時に、美しいものを愛でたり、創造する感性や芸術に触れたり、あるいは美味しいものを食べた時の幸福感もまた、金星の働きによるものとされています。金星をそう解釈すると、星占いでは定番の恋愛運も、この金星の位置を見て占うことがわかると思います。\n\n",
        "あなたが生まれた時、金星が何座に入っていたのか、他の星座との位置関係はどうか。そういうことをホロスコープから読み解くことで、あなたがどんな恋愛を望み、どんなふうに人を愛してゆくのか、恋愛に対する価値観が透けて見えてくるのです。\n\n",
        "もうひとつ、金星が表すのは「調和」。金星には人と人とを結び付け、和平的な人間関係をもたらす力があります。人と人、あるいは自分と他人を結びつける蝶番(ちょうつがい)のような役目を果たすと考えてみてください。金星のパワーがうまく働いている時は、その人は他人と協調する心を持ち、人間関係もうまくいっていることでしょう。\n\n",
        "もちろん恋愛もスムーズです。でも、この金星のパワーが偏ったり、バランスを崩してしまうと、楽しく豊かな人間関係が築けません。頑固になって他人を拒絶したり、嫉妬や束縛といった歪な愛情を示してしまうこともあります。こんなふうに占星術における金星の意味は、本来とても深いものなのです。\n\n",
        "けれどここでは金星が最も影響を与える恋愛に的を絞って解釈しようと思います。人生の最大の関心ごと!?である「私の恋愛」を、じっくりと、そして少し客観的な目で探ってみましょう。「ああ、これは金星の影響だったのか」と思えることが、きっといくつも出てくることでしょう\n\n")

st.write("Mars(火星)\n\n",

        "◇火星は闘争本能と性的エネルギーの星\n\n",

        "火星は暗い夜空に赤い光を放つ星です。その赤い色が流血や燃え上がる炎を連想させたせいか、バビロニア時代には戦いを呼ぶネルガルという神に見立てられ、災厄の星とされてしまっています。伝統的な占星術でも、火星は長らく矯正として忌み嫌われてきたという歴史を持っています。\n\n",
        "確かに火星は強い攻撃性を司る星です。例えば、誰かに足を踏まれた時、反射的に湧き上がってくる怒りと強いエネルギー。自分と同じ目標を持った相手を前にした時、心にむくむくと立ち現れるライバル意識。こうしたことを考えてみると、比較的容易に自分のうちにある火星を意識することができるかもしれません。\n\n",
        "この火星のパワーは、心理学で言う「アグレッション」を象徴しています。それは怒りのエネルギーや攻撃性と言い換えることができるでしょう。また、火星は性的なエネルギー、リビドーを表す星でもあります。このような火星のパッションは使い方を間違えると、暴力や激しやすく扱いづらい性質として、現れてしまうものです。\n\n",
        "その逆に、内なる火星の力を恐れて、それを自分の中に制圧しようとすると、強力な破壊衝動となって事故やトラブルを巻き起こすことも。そう言うパワーを秘めた星だからこそ、古代の人は火星のことを忌み嫌ったのかもしれません。\n\n",
        "しかし、時代を経て、ギリシア神話では軍神アレス、ローマ神話ではマルスという神の名が、火星に当てはめられるようになっていきます。軍神アレスは戦争付きの残酷で凶暴な神様です。けれどもローマ神話のマルスは国家を守護する神、ローマの繁栄と平和を守ってくれる強く逞しい神でした。\n\n",
        "時の流れと共に、人々は火星パワーの建設的な一面--欲するものを得るために戦うファイティングスピリッツや勇気--に気づいたのかもしれません。そう、火星の力は、上手に発揮しさえすれば、あなたの強い味方となってくれる行動力となってあらわれるようになるのです。必要なのは自分の火星パワーの特徴を知って、それをほしいものを手にするためにうまく活用していくこと。\n\n",
        "自分の中の闘争本能を恐れたり、封じ込めようとするのは愚かなことです。火星が位置する星座は、あなたがどんな戦法を得意としているのか、どう言う時にフラストレーションがたまりがちになるか、などを教えてくれます。\n\n",
        "ですから、まずは自分が生まれた時、火星がどの星座にあったかをホロスコープから探し出しましょう。これを通じてあなたは人生の有利な戦い方を身につけることができるでしょう。\n\n")

st.write("Jupiter(木星)\n\n",

        "◇可能性を広げていこうとする木星\n\n",

        "雑誌の星占い特集で、自分の星座が「12年に1度の幸運期」とされているのを目にして、喜んだ経験はないでしょうか？これは実は、約12年の周期で公転している(太陽の周りを回っている)木星が、あなたの太陽サインに入ったことを言っているのだと知っていましたか？\n\n",
        "伝統的に占星術では、木星は「グレーターベネフィック」とよばれ、大吉星とされていました。ベネフィックとは英語のベネフィット(利益)の由来となった言葉です。木星はいわば「多大な利益をもたらす星」と言うわけです。そのため、木星の配置さえよければ、大金持ちになれるとか、結婚運に恵まれるなどと、単純に解釈されることもあるのですが、心理占星術では、もう少し深く、この星の作用を見ていくことにしましょう。\n\n",
        "木星の英語名はジュビター。ギリシア神話では神々の王であるゼウスに当てはまります。木星がゼウスと同一視されたわけは、その輝きの強さのおかげだったのかもしれません。木星は太陽系における一番大きな惑星です。ところで、ゼウスはかなり浮気な神様で、数々の女神たちと恋に落ちたとされます。「もっと、もっと」と次なる愛を求めてやまないゼウスには「可能性を広げていこうとする態度」が備わっていたのです。\n\n",
        "最も大きな星である木星。守備範囲を広げてゆくことで神々の王として君臨したゼウス。こうした点から木星は「拡大と発展」を司る星と見てとることができるのです。\n\n",
        "木星は、「この世界にはもっと面白いものがあるかもしれない」「自分にはもっと大きな才能や可能性があるかもしれない」と考えさせる、健やかで肯定的な実感を人にもたらす存在なのです。この木星が位置する星座は、あなたが幸運を手に入れる上で欠かせない態度を示しています。その星座の持つ性質を拡大し、自分の中で発展させていくことができれば、あなたは自分の世界を広げ、さまざまな幸運を手にしていくことになるでしょう。\n\n",
        "けれども、木星星座の性質を理解せず、その力を発揮できないでいると、得られるはずの幸運を取り逃してしまい、人生に対して悲観的な視線を持つようになるかもしれません。自分は木星パワーをうまく発揮できているかを確認してみましょう。\n\n",
        "火星までの惑星では、あなたの性質や才能、恋愛など、個人の持つ傾向を見てきました。けれど、木星以降の星は運行速度が遅くなるため、同じ学年の人はみな同じ星座に星が入ることになります。つまり、ここからは自分の持つ性質に注目するのではなく、どう言う性質を取り込めば人生をより活き活きと輝かすことができるのかを意識して、取り組むのがポイントです。\n\n")

st.write("Saturn(土星)\n\n",

        "◇「制限」と「限界」を司るのが土星\n\n",

        "苦手だったことを克服した経験。それが自分にとっての大きな地震となっている、と言う人がいたら、その人は土星の恩恵を充分に知っている人でしょう。土星とは試練を通じて私たちを鍛え上げ、この社会の中で確かな自分の基盤を築く手助けをしてくれる星なのです。この星は占星術の長い歴史の中では禍々しい大凶星とされて、恐れられてきたと言う事実があります。\n\n",
        "「グレーターマレフィック」つまり「大きな害をなすもの」と言う名前で呼ばれたこともありました。土星が与えてくれるものといえば、災厄や死や凶作など、人々の希望を打ち砕くものだけと考えられていたのです。それと言うのも、土星はかつて地球から最も遠い惑星、宇宙の果てを運行している、いわば「境界線」「限界」を象徴している星だったからでしょう。ギリシア神話では、土星はクロノスという神様に割り当てられていました。\n\n",
        "クロノスとは時間と歴史を司る神。時間はあらゆることに制限を与えます。何人も時間の法則、その限界から逃れることはできません。けれども、人は限界を知ることによって初めて計画性を持ち、自分の目指すべき頂点を見据えることができるのではないでしょうか？例えば、時間がたっぷりあるほど、ダラダラと前に進まない仕事や勉強も、締め切りを指示された途端、集中力が発揮され、あっという間に片付くということがあるはず。\n\n",
        "土星はそういうパワーを与えてくれる星でもあるのです。土星があなたに与えるであろう試練と、その上手な乗り越え方に「集中して」取り組んでください。どんな試練が待ち受けているのか、恐れる必要はありません。土星のパワーをしっかりと発揮すれば、必ずあなたはその試練を乗り越えることができます。そして、今まで以上に逞しい自分に出会うことになるでしょう。\n\n",
        "ワークシートによくある「14歳、29歳の頃にあった出来事」というのは、占星術で「サターンリターン」と呼ばれる、誰しもに平等に訪れる試練の年を指しています。これは占星術上の「厄年」のようなものだと考えるとわかりやすいかもしれません。また、時期とは関係なく、苦手意識を持っているもの、人より時間をかけなければできないこと、というのも土星のパワーを活かせば、実は特技へと変えられる分野に当たります。\n\n",
        "何ごとも天才ではない限り、習得するのに時間がかかるものですが、かけた時間の分だけ人より秀でることができるとしたら、積極的に取り組むだけの価値があるはず。そんな事実にも気づいてもらえればと思います。\n\n")

st.write("Uranus(天王星)\n\n",

        "◇古時代に革新をもたらす天王星\n\n",

        "占星術の世界は、長い間太陽から土星までの7惑星で主に考えられてきました。その伝統、価値観に大きな変転を起こすきっかけになったのは18世紀を迎えてから発見された天王星だったのです。フランス革命やアメリカの独立など、時はまさに革命の時代。その頃にこの星は人類の前にその姿を表したのです。そのため、天王星は「改革と革新を司る星」とされてきました。\n\n",
        "ただ、この天王星の公転周期は84年。土星は約30年ですからその倍以上の時間をかけて、この星は太陽の周りを一周していることになります。したがって、ひとつの星座を移動するにも7年かかるのです。占星術では土星以降の外天体(天王星、海王星、冥王星)のことを「トランサタニアン」と呼んで、同じ世代に共通する特徴や、世代的な影響を司るものと考えます。\n\n",
        "天王星のパワーは、易々と使いこなすことはできないものです。けれども、これまでの常識や価値観、社会の構造を打ち破ろうとするする時、あなたは自分の内なる天王星のパワーを、はっきりと感じ取ることができるでしょう。発明、改革、発見、変化。こうしたものを司るのが天王星であり、この星の力は、常に新しい未来に向けられているのです。\n\n")

st.write("Neptune(海王星)\n\n",

        "◇海王星の作用は陶酔を生み出す\n\n",

        "天王星よりも、さらに外側に発見された天体、それが海王星でした。太陽の周りを一周するのに165年もの期間を必要とします。つまり、あなたが生まれたときに位置していたポイントに、海王星が再び戻ってくるのは、165年後ということになります。気の遠くなるような話ではありませんか。\n\n",
        "そんな海王星は、私たちの年月に対する想像力を超えるような存在だと考えることができるかもしれません。自己という小さな殻の外にある星。意識の境界線を「溶解」し、不定形な無意識の彼方に、自己を連れ去る星。海王星は、混沌や忘却、陶酔といった事象を司っているのです。この海王星のパワーとは、一言で言えば、現実世界に魔法の霧をかける力です。\n\n",
        "アルコールや音楽、ムードに酔っている時。現実を直視することを忘れます。こうした酔いをもたらすのが海王星のパワーなのです。海王星は約14年間、ひとつの星座に留まります。ですから、大抵の場合は、親と子供は別の星座に海王星を持つことになります。親の世代とあなたの世代の特徴を分けるもの。海王星の位置する星座はそれを教えてくれます。\n\n")

st.write("Pluto(冥王星)\n\n",

        "◇「闇の世界」を象徴する破壊と再生の星\n\n",

        "太陽系の最果てに、1930年に発見された冥王星。この星は200年以上の時をかけて、12星座を巡ります。1930年から現在までは、まだ200年を経ていません。つまり発見以降の観測では、この星は全ての星座をまだ通過していないのです。そんな遠大な周期で動いている、この未知の天体に、天文学はプルトーという名前をつけました。\n\n",
        "プルトーはローマ神話に出てくる冥界の王の名前です。簡単に言えば、冥王星は「闇の世界」を象徴している星と言えるでしょう。人はみんな、嫉妬や憎悪といった暗くネガティイブな闇の感情に駆られることがあるものです。偉大な作家や思想家は、この心の闇、心の深部へと下降することで、魂の変容を体験したり、人々の心の奥深くに迫る作品や思想を得ることがあります。\n\n",
        "冥王星のパワーとは、まるで自らを地獄の炎に投げ込み、そこから蘇ってくる不死鳥、フェニックスのような、「人生の変容」を促す力です。物事を根底から破壊し、再生するパワー。そんな冥王星の力には誰も争うことはできません。この星の位置する星座は、その世代が経験することになるかもしれない人生や魂の変容のありさまを伝えるものです。\n\n")